#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan main 📖``

<details><summary>Show Plan</summary>

```

provision
random_password.password: Refreshing state... [id=none]
module.pve-vm.proxmox_vm_qemu.vm: Refreshing state... [id=pve/qemu/100]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.pve-vm.proxmox_vm_qemu.vm must be replaced
-/+ resource "proxmox_vm_qemu" "vm" {
      ~ cores                     = 2 -> 3
      + default_ipv4_address      = (known after apply)
      - disk_gb                   = 0 -> null
      ~ id                        = "pve/qemu/100" -> (known after apply)
      ~ ipconfig0                 = "ip=192.168.10.100/24,gw=192.168.10.1" -> "ip=192.168.10.110/24,gw=192.168.10.1" # forces replacement
      ~ memory                    = 4096 -> 8192
      ~ name                      = "dev-srv" -> "main-srv"
      + nameserver                = (known after apply)
      - qemu_os                   = "other" -> null
      ~ reboot_required           = false -> (known after apply)
      + searchdomain              = (known after apply)
      + ssh_host                  = (known after apply)
      + ssh_port                  = (known after apply)
      ~ sshkeys                   = <<-EOT
            ecdsa-sha2-nistp521 AAAAE2VjZHNhLXNoYTItbmlzdHA1MjEAAAAIbmlzdHA1MjEAAACFBAEC7fki9UNyuFGcNNeAOGCbUXxf/w+JGkKp7BR68gMTNmMYBE4/x+naDqJgajJElPuAYJaI715XBgKAOg+gwce2vwB9+XzRPCClEo6zZB56HugAVpnkje9PpdYJS6tattzD/56ofFDQltXVdYAuE49eOBNoyiD9I9y20inXkVJuEg5PCw==
        EOT
      ~ unused_disk               = [] -> (known after apply)
      ~ vmid                      = 100 -> 110 # forces replacement
        # (29 unchanged attributes hidden)

      ~ disk {
          ~ file               = "vm-100-disk-0" -> (known after apply)
          ~ format             = "raw" -> (known after apply)
          + media              = (known after apply)
          ~ size               = "64G" -> "650G"
          ~ storage_type       = "lvmthin" -> (known after apply)
          ~ volume             = "local-lvm:vm-100-disk-0" -> (known after apply)
            # (22 unchanged attributes hidden)
        }

      ~ network {
          ~ macaddr   = "BE:27:BC:BA:6E:37" -> (known after apply)
          - mtu       = 0 -> null
          ~ queues    = 0 -> (known after apply)
          ~ rate      = 0 -> (known after apply)
            # (5 unchanged attributes hidden)
        }
    }

Plan: 1 to add, 0 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>
*Pushed by: @vpletea, Action: `pull_request`*